In [1]:
import pandas as pd

In [10]:
df1 = pd.DataFrame([[3,2,5], [10,0,2], [6,5,3]],
                  columns=["사과", "자두", "포도"],
                  index=["이성계", "김유신", "이순신"])
s1 = df1["사과"]

In [11]:
df1

     사과  자두  포도
이성계   3   2   5
김유신  10   0   2
이순신   6   5   3

In [25]:
s1 # 시리즈

이성계     3
김유신    10
이순신     6
Name: 사과, dtype: int64

In [13]:
df1.sum() # 세로 방향이 디폴트

사과    19
자두     7
포도    10
dtype: int64

In [14]:
df1.mean()

사과    6.333333
자두    2.333333
포도    3.333333
dtype: float64

## values, index, columns를 확인하다

In [18]:
df1.values

array([[ 3,  2,  5],
       [10,  0,  2],
       [ 6,  5,  3]], dtype=int64)

In [19]:
df1.index

Index(['이성계', '김유신', '이순신'], dtype='object')

In [20]:
df1.columns

Index(['사과', '자두', '포도'], dtype='object')

## 데이터프레임과 시리즈를 bool 형태로 변화

In [22]:
df1.values > 3 # 판다스의 데이퍼프레임 넘퍼스 특징

array([[False, False,  True],
       [ True, False, False],
       [ True,  True, False]])

In [23]:
df1 > 3 # 라벨을 가진 똑같은 배열

        사과     자두     포도
이성계  False  False   True
김유신   True  False  False
이순신   True   True  False

In [26]:
s1 > 3

이성계    False
김유신     True
이순신     True
Name: 사과, dtype: bool

In [27]:
pd.read_excel("E00EXAMPLE.xlsx")

    이름  국어  영어  수학  과학
0  강동원  63  93  67  71
1  송중기  89  83  71  80
2  기태영  83  76  92  98
3  김남길  94  88  73  93
4  류준열  71  83  80  88
5  박성균  67  87  92  90

In [28]:
pd.read_excel("E00EXAMPLE.xlsx").set_index("이름") # index 이름 지정

     국어  영어  수학  과학
이름
강동원  63  93  67  71
송중기  89  83  71  80
기태영  83  76  92  98
김남길  94  88  73  93
류준열  71  83  80  88
박성균  67  87  92  90